In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import pandas as pd
import datetime as dt
# Datetime is not external library. It is a module, built in optional library.

## Review of Python's `datetime` Module

In [3]:
someday = dt.date(2010, 1, 20)

In [4]:
someday.year
someday.month
someday.day
type(someday)

2010

1

20

datetime.date

In [5]:
str(someday)

'2010-01-20'

In [6]:
type(dt.datetime(2010, 1, 10, 17, 13, 57))

datetime.datetime

In [7]:
str(dt.datetime(2010, 1, 10, 17, 13, 57))

'2010-01-10 17:13:57'

In [90]:
sometime = dt.datetime(2010, 1, 10, 17, 13, 57)
sometime
someday
str(sometime)
str(someday)

datetime.datetime(2010, 1, 10, 17, 13, 57)

Timestamp('2011-12-23 00:00:00')

'2010-01-10 17:13:57'

'2011-12-23 00:00:00'

In [9]:
sometime.year
sometime.month
sometime.day
sometime.hour
sometime.minute
sometime.second

2010

1

10

17

13

57

## The `pandas Timestamp` Object

In [10]:
# timestamp object is a single moment of time.
pd.Timestamp("2015-03-31")
pd.Timestamp("2015/03/31")
pd.Timestamp("2013, 11, 04")
pd.Timestamp("1/1/2015")
pd.Timestamp("19/12/2015")
pd.Timestamp("12/19/2015")
pd.Timestamp("4/3/2000")
pd.Timestamp("2021-03-08 08:35:15")
pd.Timestamp("2021-03-08 6:13:29 PM")

Timestamp('2015-03-31 00:00:00')

Timestamp('2015-03-31 00:00:00')

Timestamp('2013-11-04 00:00:00')

Timestamp('2015-01-01 00:00:00')

Timestamp('2015-12-19 00:00:00')

Timestamp('2015-12-19 00:00:00')

Timestamp('2000-04-03 00:00:00')

Timestamp('2021-03-08 08:35:15')

Timestamp('2021-03-08 18:13:29')

In [11]:
pd.Timestamp(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [12]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))

Timestamp('2000-02-03 21:35:22')

In [76]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))
type(pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22)))

Timestamp('2000-02-03 21:35:22')

pandas._libs.tslibs.timestamps.Timestamp

## The `pandas DateTimeIndex` Object

In [88]:
# collection of pandas timestamps object.
dates = ["2016/01/02", "2016/04/12", "2009/09/07"]
pd.DatetimeIndex(dates)

DatetimeIndex(['2016-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [98]:
pd.DatetimeIndex([someday])
pd.DatetimeIndex([sometime])

DatetimeIndex(['2011-12-23'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2010-01-10'], dtype='datetime64[ns]', freq=None)

In [82]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 29)]
dtIndex = pd.DatetimeIndex(dates)
dtIndex

DatetimeIndex(['2016-01-10', '1994-06-13', '2003-12-29'], dtype='datetime64[ns]', freq=None)

In [16]:
values = [100, 200, 300]
pd.Series(data = values, index = dtIndex)

2016-01-10    100
1994-06-13    200
2003-12-29    300
dtype: int64

## The `pd.to_datetime()` Method

In [99]:
pd.to_datetime("2001-04-19")
type(pd.to_datetime("2001-04-19"))
pd.to_datetime(dt.date(2015, 1, 1))
# type(pd.to_datetime(dt.date(2015, 1, 1)))
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])

Timestamp('2001-04-19 00:00:00')

pandas._libs.tslibs.timestamps.Timestamp

Timestamp('2015-01-01 00:00:00')

pandas._libs.tslibs.timestamps.Timestamp

Timestamp('2015-01-01 14:35:20')

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [18]:
# check the datatype.
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])
times
# here times is just a series of strings, not a datetime object.

0        2015-01-03
1        2014/02/08
2              2016
3    July 4th, 1996
dtype: object

In [19]:
pd.to_datetime(times)
# pd.Timestamp(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [20]:
dates = pd.Series(["July 4th, 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [21]:
pd.to_datetime(dates, errors = "coerce")
# not a time.

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [22]:
pd.to_datetime([1349720105, 1349806505, 1349892905, 1349979305, 1350065705], unit = "s")

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

In [23]:
pd.Period("2016-01-08", freq = "10D")

Period('2016-01-08', '10D')

In [24]:
dates = ["2016-01-01", "2016-02-01", "2016-03-01"]
pd.Series([1, 2, 3], index = pd.PeriodIndex(dates, freq = "2M"))
# type(pd.Series([1, 2, 3], index = pd.PeriodIndex(dates, freq = "2M")))

2016-01    1
2016-02    2
2016-03    3
Freq: 2M, dtype: int64

In [25]:
pd.Period("2016-01-08", freq = "W")
pd.Period("2016-01-08", freq = "W-SUN")
pd.Period("2016-01-08", freq = "W-WED")
pd.Period("2015-12-10", freq = "10D")

# dates = ["2016-01-01", "2016-02-01", "2016-02-01"]
# pd.PeriodIndex(dates, freq = "W-MON")
# weeks = pd.PeriodIndex(dates, freq = "W-MON")


# pd.Series([999, 500, 325], index = weeks, name = "Weekly Revenue")

Period('2016-01-04/2016-01-10', 'W-SUN')

Period('2016-01-04/2016-01-10', 'W-SUN')

Period('2016-01-07/2016-01-13', 'W-WED')

Period('2015-12-10', '10D')

## Create Range of Dates with the `pd.date_range()` Method, Part 1

In [26]:
times = pd.date_range(start = "2016-01-01", end = "2016-1-10", freq = "b")
times = pd.date_range(start = "2016-01-01", end = "2016-1-10", freq = "w-fri")
times = pd.date_range(start = "2016-01-01", end = "2016-1-10", freq = "6h")
times

DatetimeIndex(['2016-01-01 00:00:00', '2016-01-01 06:00:00',
               '2016-01-01 12:00:00', '2016-01-01 18:00:00',
               '2016-01-02 00:00:00', '2016-01-02 06:00:00',
               '2016-01-02 12:00:00', '2016-01-02 18:00:00',
               '2016-01-03 00:00:00', '2016-01-03 06:00:00',
               '2016-01-03 12:00:00', '2016-01-03 18:00:00',
               '2016-01-04 00:00:00', '2016-01-04 06:00:00',
               '2016-01-04 12:00:00', '2016-01-04 18:00:00',
               '2016-01-05 00:00:00', '2016-01-05 06:00:00',
               '2016-01-05 12:00:00', '2016-01-05 18:00:00',
               '2016-01-06 00:00:00', '2016-01-06 06:00:00',
               '2016-01-06 12:00:00', '2016-01-06 18:00:00',
               '2016-01-07 00:00:00', '2016-01-07 06:00:00',
               '2016-01-07 12:00:00', '2016-01-07 18:00:00',
               '2016-01-08 00:00:00', '2016-01-08 06:00:00',
               '2016-01-08 12:00:00', '2016-01-08 18:00:00',
               '2016-01-09 00:00:00', '2016-01-09 06:00:00',
               '2016-01-09 12:00:00', '2016-01-09 18:00:00',
               '2016-01-10 00:00:00'],
              dtype='datetime64[ns]', freq='6H')

In [27]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [28]:
times[0]

Timestamp('2016-01-01 00:00:00', freq='6H')

In [29]:
type(times[0])

pandas._libs.tslibs.timestamps.Timestamp

In [30]:
pd.date_range(start = "2016-01-01", end = "2050-01-01", freq = "A")

DatetimeIndex(['2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31', '2037-12-31', '2038-12-31', '2039-12-31',
               '2040-12-31', '2041-12-31', '2042-12-31', '2043-12-31',
               '2044-12-31', '2045-12-31', '2046-12-31', '2047-12-31',
               '2048-12-31', '2049-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

## Create Range of Dates with the `pd.date_range()` Method, Part 2

In [31]:
pd.date_range(start = "2012-09-09", periods = 3, freq = "6h")

DatetimeIndex(['2012-09-09 00:00:00', '2012-09-09 06:00:00',
               '2012-09-09 12:00:00'],
              dtype='datetime64[ns]', freq='6H')

## Create Range of Dates with the `pd.date_range()` Method, Part 3

In [32]:
pd.date_range(end = "1999-12-31", periods = 11, freq = "7H")

DatetimeIndex(['1999-12-28 02:00:00', '1999-12-28 09:00:00',
               '1999-12-28 16:00:00', '1999-12-28 23:00:00',
               '1999-12-29 06:00:00', '1999-12-29 13:00:00',
               '1999-12-29 20:00:00', '1999-12-30 03:00:00',
               '1999-12-30 10:00:00', '1999-12-30 17:00:00',
               '1999-12-31 00:00:00'],
              dtype='datetime64[ns]', freq='7H')

## The `.dt` Accessor... Like .str accessors.
### to get attributes from a series of datetime objects.

In [33]:
bunch_of_dates = pd.date_range(start = "2000-01-01", end = "2010-12-31", freq = "24D")

In [34]:
s = pd.Series(bunch_of_dates)
s.head(3)

0   2000-01-01
1   2000-01-25
2   2000-02-18
dtype: datetime64[ns]

In [35]:
mask = s.dt.is_month_end
# filteration based on a boolean series, obtained above.
s[mask]

5     2000-04-30
57    2003-09-30
71    2004-08-31
90    2005-11-30
123   2008-01-31
161   2010-07-31
dtype: datetime64[ns]

## Import Financial Data Set with `pandas_datareader` Library

In [36]:
import pandas as pd
import datetime as dt
# below imports only a section of library. this saves memory.

from pandas_datareader import data
# from pandas_datareader import data as dt12

In [37]:
company = "MSFT"
start = "2010-01-01"
end = "2020-12-31"

stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.tail(3)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-12-29,227.179993,223.580002,226.309998,224.149994,17403200.0,223.119720
2020-12-30,225.630005,221.470001,225.229996,221.679993,20272300.0,220.661072
2020-12-31,223.000000,219.679993,221.699997,222.419998,20942100.0,221.397675

In [38]:
type(stocks)

pandas.core.frame.DataFrame

In [39]:
stocks.values
stocks.columns
stocks.index[0]
stocks.index
stocks.axes

array([[3.09899998e+01, 3.04799995e+01, 3.09799995e+01, 3.04799995e+01,
        3.19297000e+07, 2.36301861e+01],
       [3.11000004e+01, 3.05900002e+01, 3.06200008e+01, 3.09500008e+01,
        3.84091000e+07, 2.39945641e+01],
       [3.11000004e+01, 3.06399994e+01, 3.08500004e+01, 3.09599991e+01,
        4.97496000e+07, 2.40023193e+01],
       ...,
       [2.27179993e+02, 2.23580002e+02, 2.26309998e+02, 2.24149994e+02,
        1.74032000e+07, 2.23119720e+02],
       [2.25630005e+02, 2.21470001e+02, 2.25229996e+02, 2.21679993e+02,
        2.02723000e+07, 2.20661072e+02],
       [2.23000000e+02, 2.19679993e+02, 2.21699997e+02, 2.22419998e+02,
        2.09421000e+07, 2.21397675e+02]])

Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')

Timestamp('2009-12-31 00:00:00')

DatetimeIndex(['2009-12-31', '2010-01-04', '2010-01-05', '2010-01-06',
               '2010-01-07', '2010-01-08', '2010-01-11', '2010-01-12',
               '2010-01-13', '2010-01-14',
               ...
               '2020-12-17', '2020-12-18', '2020-12-21', '2020-12-22',
               '2020-12-23', '2020-12-24', '2020-12-28', '2020-12-29',
               '2020-12-30', '2020-12-31'],
              dtype='datetime64[ns]', name='Date', length=2770, freq=None)

[DatetimeIndex(['2009-12-31', '2010-01-04', '2010-01-05', '2010-01-06',
                '2010-01-07', '2010-01-08', '2010-01-11', '2010-01-12',
                '2010-01-13', '2010-01-14',
                ...
                '2020-12-17', '2020-12-18', '2020-12-21', '2020-12-22',
                '2020-12-23', '2020-12-24', '2020-12-28', '2020-12-29',
                '2020-12-30', '2020-12-31'],
               dtype='datetime64[ns]', name='Date', length=2770, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

## Selecting from a `DataFrame` with a `DateTimeIndex`

In [40]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.630186
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  23.994564
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.002319

In [41]:
stocks.loc["2014-03-04"]
stocks.iloc[300]
# stocks.ix["2014-03-04"]
# stocks.ix[300]

High         3.848000e+01
Low          3.807000e+01
Open         3.820000e+01
Close        3.841000e+01
Volume       2.680240e+07
Adj Close    3.330725e+01
Name: 2014-03-04 00:00:00, dtype: float64

High         2.585000e+01
Low          2.536000e+01
Open         2.541000e+01
Close        2.568000e+01
Volume       4.990580e+07
Adj Close    2.044368e+01
Name: 2011-03-11 00:00:00, dtype: float64

In [42]:
# stocks.ix["2016-01-01"]

In [43]:
stocks.loc["2013-10-01" : "2013-10-07"]
# stocks.ix["2013-10-01" : "2013-10-07"]

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  28.684647
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  28.975079
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  28.923819
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  28.940907
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.445459

In [44]:
# stockprice on birthday over years.
birthdays = pd.date_range(start = "1991-04-12", end = "2020-12-31", freq = pd.DateOffset(years = 1))

In [45]:
mask = stocks.index.isin(birthdays)

In [46]:
stocks[mask]
stocks.loc[mask]

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2010-04-12,30.490000,30.209999,30.250000,30.320000,37068800.0,23.616060
2011-04-12,25.850000,25.549999,25.830000,25.639999,36920400.0,20.411831
2012-04-12,31.040001,30.420000,30.480000,30.980000,38304000.0,25.335123
2013-04-12,29.020000,28.660000,28.850000,28.790001,62886300.0,24.250801
2016-04-12,54.779999,53.759998,54.369999,54.650002,24944300.0,49.997059
2017-04-12,65.510002,65.110001,65.419998,65.230003,17108500.0,61.245777
2018-04-12,94.160004,92.430000,92.430000,93.580002,26758900.0,89.704170
2019-04-12,120.980003,120.370003,120.639999,120.949997,19745100.0,117.897560

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2010-04-12,30.490000,30.209999,30.250000,30.320000,37068800.0,23.616060
2011-04-12,25.850000,25.549999,25.830000,25.639999,36920400.0,20.411831
2012-04-12,31.040001,30.420000,30.480000,30.980000,38304000.0,25.335123
2013-04-12,29.020000,28.660000,28.850000,28.790001,62886300.0,24.250801
2016-04-12,54.779999,53.759998,54.369999,54.650002,24944300.0,49.997059
2017-04-12,65.510002,65.110001,65.419998,65.230003,17108500.0,61.245777
2018-04-12,94.160004,92.430000,92.430000,93.580002,26758900.0,89.704170
2019-04-12,120.980003,120.370003,120.639999,120.949997,19745100.0,117.897560

## `Timestamp` Object Attributes

In [47]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.630186
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  23.994564
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.002319

In [48]:
someday = stocks.index[500]
someday

Timestamp('2011-12-23 00:00:00')

In [49]:
someday.day
someday.month
someday.month_name()
someday.year
someday.dayofweek
someday.day_name()


# below returns boolean
someday.is_month_end
someday.is_month_start

23

12

'December'

2011

4

'Friday'

False

False

In [50]:
stocks.insert(0, "Day of Week", stocks.index.dayofweek)

In [51]:
stocks.insert(1, "Is Start of Month", stocks.index.is_month_start)

In [52]:
stocks[stocks["Is Start of Month"]]

,Day of Week,Is Start of Month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-02-01,0,True,28.480000,27.920000,28.389999,28.410000,85931100.0,22.025387
2010-03-01,0,True,29.049999,28.530001,28.770000,29.020000,43805400.0,22.603508
2010-04-01,3,True,29.540001,28.620001,29.350000,29.160000,74768100.0,22.712545
2010-06-01,1,True,26.309999,25.520000,25.530001,25.889999,76152400.0,20.256563
2010-07-01,3,True,23.320000,22.730000,23.090000,23.160000,92239400.0,18.120586
...,...,...,...,...,...,...,...,...
2020-06-01,0,True,183.000000,181.460007,182.539993,182.830002,22622400.0,181.076721
2020-07-01,2,True,206.350006,201.770004,203.139999,204.699997,32061200.0,202.736984
2020-09-01,1,True,227.449997,224.429993,225.509995,227.270004,25725500.0,225.634674
2020-10-01,3,True,213.990005,211.320007,213.490005,212.460007,27158400.0,210.931229
2020-12-01,1,True,217.320007,213.350006,214.509995,216.210007,30904500.0,215.216232

## The `.truncate()` Method

In [53]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.630186
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  23.994564
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.002319

In [54]:
stocks.truncate(before = "2012-06-07", after = "2013-02-28")

                 High        Low       Open      Close      Volume  Adj Close
Date
2012-06-07  29.700001  29.170000  29.639999  29.230000  37792800.0  24.060835
2012-06-08  29.680000  29.049999  29.209999  29.650000  42551100.0  24.406563
2012-06-11  29.809999  28.820000  29.730000  28.900000  46361900.0  23.789192
2012-06-12  29.299999  28.840000  29.100000  29.290001  35337900.0  24.110222
2012-06-13  29.440001  29.049999  29.219999  29.129999  32984600.0  23.978516
...               ...        ...        ...        ...         ...        ...
2013-02-22  27.760000  27.480000  27.680000  27.760000  31425900.0  23.383196
2013-02-25  28.049999  27.370001  27.969999  27.370001  48011800.0  23.054688
2013-02-26  27.600000  27.340000  27.379999  27.370001  49923300.0  23.054688
2013-02-27  28.000000  27.330000  27.420000  27.809999  36394700.0  23.425314
2013-02-28  27.969999  27.740000  27.879999  27.799999  35840200.0  23.416891

[182 rows x 6 columns]

## `pd.DateOffset` Objects

In [55]:

stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())
stocks.head(3)
stocks.tail()
stocks

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813290  49.982655  44871361.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942874.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342897.0  54.495735

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2021-05-17,2323.340088,2295.000000,2309.320068,2321.409912,992100.0,2321.409912
2021-05-18,2343.149902,2303.159912,2336.906006,2303.429932,865100.0,2303.429932
2021-05-19,2316.760010,2263.520020,2264.399902,2308.709961,967500.0,2308.709961
2021-05-20,2360.340088,2321.090088,2328.040039,2356.090088,1191600.0,2356.090088
2021-05-21,2369.000000,2342.370117,2365.989990,2345.100098,1139600.0,2345.100098

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2004-08-19,51.835709,47.800831,49.813290,49.982655,44871361.0,49.982655
2004-08-20,54.336334,50.062355,50.316402,53.952770,22942874.0,53.952770
2004-08-23,56.528118,54.321388,55.168217,54.495735,18342897.0,54.495735
2004-08-24,55.591629,51.591621,55.412300,52.239197,15319808.0,52.239197
2004-08-25,53.798351,51.746044,52.284027,52.802086,9232276.0,52.802086
...,...,...,...,...,...,...
2021-05-17,2323.340088,2295.000000,2309.320068,2321.409912,992100.0,2321.409912
2021-05-18,2343.149902,2303.159912,2336.906006,2303.429932,865100.0,2303.429932
2021-05-19,2316.760010,2263.520020,2264.399902,2308.709961,967500.0,2308.709961
2021-05-20,2360.340088,2321.090088,2328.040039,2356.090088,1191600.0,2356.090088
2021-05-21,2369.000000,2342.370117,2365.989990,2345.100098,1139600.0,2345.100098

In [56]:
stocks.index + pd.DateOffset(months = 8, years = 5, days = 12, hours = 3, minutes = 42)

DatetimeIndex(['2010-05-01 03:42:00', '2010-05-02 03:42:00',
               '2010-05-05 03:42:00', '2010-05-06 03:42:00',
               '2010-05-07 03:42:00', '2010-05-08 03:42:00',
               '2010-05-09 03:42:00', '2010-05-12 03:42:00',
               '2010-05-12 03:42:00', '2010-05-13 03:42:00',
               ...
               '2027-01-22 03:42:00', '2027-01-23 03:42:00',
               '2027-01-24 03:42:00', '2027-01-25 03:42:00',
               '2027-01-26 03:42:00', '2027-01-29 03:42:00',
               '2027-01-30 03:42:00', '2027-01-31 03:42:00',
               '2027-02-01 03:42:00', '2027-02-02 03:42:00'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

## More Fun with `pd.DateOffset` Objects
### to round up date say to month end or quarter.

In [57]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

# additional custom offsets. 
# timeseries module/ folder.
from pandas.tseries.offsets import *

In [58]:
stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())

stocks.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813290  49.982655  44871361.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942874.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342897.0  54.495735

In [59]:
stocks.index

DatetimeIndex(['2004-08-19', '2004-08-20', '2004-08-23', '2004-08-24',
               '2004-08-25', '2004-08-26', '2004-08-27', '2004-08-30',
               '2004-08-31', '2004-09-01',
               ...
               '2021-05-10', '2021-05-11', '2021-05-12', '2021-05-13',
               '2021-05-14', '2021-05-17', '2021-05-18', '2021-05-19',
               '2021-05-20', '2021-05-21'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

In [60]:
stocks.index + MonthEnd()
stocks.index - BMonthEnd()
stocks.index + QuarterEnd()
stocks.index + QuarterBegin()

DatetimeIndex(['2004-08-31', '2004-08-31', '2004-08-31', '2004-08-31',
               '2004-08-31', '2004-08-31', '2004-08-31', '2004-08-31',
               '2004-09-30', '2004-09-30',
               ...
               '2021-05-31', '2021-05-31', '2021-05-31', '2021-05-31',
               '2021-05-31', '2021-05-31', '2021-05-31', '2021-05-31',
               '2021-05-31', '2021-05-31'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

DatetimeIndex(['2004-07-30', '2004-07-30', '2004-07-30', '2004-07-30',
               '2004-07-30', '2004-07-30', '2004-07-30', '2004-07-30',
               '2004-07-30', '2004-08-31',
               ...
               '2021-04-30', '2021-04-30', '2021-04-30', '2021-04-30',
               '2021-04-30', '2021-04-30', '2021-04-30', '2021-04-30',
               '2021-04-30', '2021-04-30'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

DatetimeIndex(['2004-09-30', '2004-09-30', '2004-09-30', '2004-09-30',
               '2004-09-30', '2004-09-30', '2004-09-30', '2004-09-30',
               '2004-09-30', '2004-09-30',
               ...
               '2021-06-30', '2021-06-30', '2021-06-30', '2021-06-30',
               '2021-06-30', '2021-06-30', '2021-06-30', '2021-06-30',
               '2021-06-30', '2021-06-30'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

DatetimeIndex(['2004-09-01', '2004-09-01', '2004-09-01', '2004-09-01',
               '2004-09-01', '2004-09-01', '2004-09-01', '2004-09-01',
               '2004-09-01', '2004-12-01',
               ...
               '2021-06-01', '2021-06-01', '2021-06-01', '2021-06-01',
               '2021-06-01', '2021-06-01', '2021-06-01', '2021-06-01',
               '2021-06-01', '2021-06-01'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

In [61]:
stocks.index + YearBegin()

DatetimeIndex(['2005-01-01', '2005-01-01', '2005-01-01', '2005-01-01',
               '2005-01-01', '2005-01-01', '2005-01-01', '2005-01-01',
               '2005-01-01', '2005-01-01',
               ...
               '2022-01-01', '2022-01-01', '2022-01-01', '2022-01-01',
               '2022-01-01', '2022-01-01', '2022-01-01', '2022-01-01',
               '2022-01-01', '2022-01-01'],
              dtype='datetime64[ns]', name='Date', length=4219, freq=None)

## The `Timedelta` Object
### it represents a duration

In [62]:
timeA = pd.Timestamp("2016-03-31 04:35:16 PM")
timeB = pd.Timestamp("2016-03-20 02:16:49 AM")

In [63]:
timeB - timeA

Timedelta('-12 days +09:41:33')

In [64]:
type(timeA - timeB)

pandas._libs.tslibs.timedeltas.Timedelta

In [65]:
type(timeA)

pandas._libs.tslibs.timestamps.Timestamp

In [66]:
pd.Timedelta(weeks = 8, days = 3, hours = 12, minutes = 45)

Timedelta('59 days 12:45:00')

In [67]:
pd.Timedelta("14 days 6 hours 12 minutes 49 seconds")

Timedelta('14 days 06:12:49')

## `Timedeltas` in a Dataset

In [68]:
shipping = pd.read_csv("ecommerce.csv", index_col = "ID", parse_dates = ["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [69]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]

In [70]:
shipping.head(3)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [71]:
shipping["Twice As Long"] = shipping["delivery_date"] + shipping["Delivery Time"]

In [72]:
shipping.head(3)

   order_date delivery_date Delivery Time Twice As Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [73]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice As Long     datetime64[ns]
dtype: object

In [74]:
mask = shipping["Delivery Time"] > "365 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
2   1992-04-22    1998-03-06     2144 days    2004-01-18
4   1991-02-10    1992-08-26      563 days    1994-03-12
5   1992-07-21    1997-11-20     1948 days    2003-03-22
7   1993-09-02    1998-06-10     1742 days    2003-03-18
9   1990-01-25    1994-10-02     1711 days    1999-06-09
..         ...           ...           ...           ...
986 1990-12-10    1992-12-16      737 days    1994-12-23
990 1991-06-24    1996-02-02     1684 days    2000-09-12
991 1991-09-09    1998-03-30     2394 days    2004-10-18
993 1990-11-16    1998-04-27     2719 days    2005-10-06
997 1990-01-04    1991-10-03      637 days    1993-07-01

[394 rows x 4 columns]

In [75]:
shipping["Delivery Time"].mean()

Timedelta('1217 days 22:53:53.532934128')